In [1]:
import pandas as pd
import numpy as nm

In [2]:
df = pd.read_csv('supershops.csv')

In [8]:
df2=df.copy()
df3=df.copy()
df4=df.copy()
df5=df.copy()

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [6]:
df.shape

(50, 5)

In [7]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

# MinMaxScalar / Normalization

In [10]:
from sklearn.preprocessing import MinMaxScaler

In [11]:
m = MinMaxScaler()

In [12]:
df[('Marketing Spend Transform')]=m.fit_transform(df[['Marketing Spend']])

In [13]:
df.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.692617
1,162597.70,151377.59,443898.53,Ctg,191792.06,0.983359
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0.927985
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0.873136
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0.859438

In [14]:
df[('Administration Transform')]=m.fit_transform(df[['Administration']])

In [15]:
df.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform,Administration Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.692617,0.651744
1,162597.70,151377.59,443898.53,Ctg,191792.06,0.983359,0.761972
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0.927985,0.379579
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0.873136,0.512998
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0.859438,0.305328

# Standard Scaler / Standardization

In [16]:
from sklearn.preprocessing import StandardScaler

In [18]:
s = StandardScaler()

In [19]:
df2[('Marketing Spend Transform')]=s.fit_transform(df[['Marketing Spend']])
df2[('Administration Transform')]=s.fit_transform(df[['Administration']])

In [20]:
df2.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform,Administration Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.897913,0.560753
1,162597.70,151377.59,443898.53,Ctg,191792.06,1.955860,1.082807
2,153441.51,101145.55,407934.54,Rangpur,191050.39,1.754364,-0.728257
3,144372.41,118671.85,383199.62,Dhaka,182901.99,1.554784,-0.096365
4,142107.34,91391.77,366168.42,Rangpur,166187.94,1.504937,-1.079919

In [21]:
df2.shape

(50, 7)

In [22]:
df.shape

(50, 7)

# Max Abs Scaler

In [23]:
from sklearn.preprocessing import MaxAbsScaler

In [24]:
ab = MaxAbsScaler()

In [25]:
df3[('Marketing Spend Transform')]=ab.fit_transform(df[['Marketing Spend']])
df3[('Administration Transform')]=ab.fit_transform(df[['Administration']])

In [26]:
df3.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform,Administration Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.692617,0.749527
1,162597.70,151377.59,443898.53,Ctg,191792.06,0.983359,0.828805
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0.927985,0.553781
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0.873136,0.649738
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0.859438,0.500378

# Robust Scaler

In [27]:
from sklearn.preprocessing import RobustScaler

In [28]:
rs = RobustScaler()

In [29]:
df4[('Marketing Spend Transform')]=rs.fit_transform(df[['Marketing Spend']])
df4[('Administration Transform')]=rs.fit_transform(df[['Administration']])

In [30]:
df4.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform,Administration Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.672530,0.345355
1,162597.70,151377.59,443898.53,Ctg,191792.06,1.452113,0.697565
2,153441.51,101145.55,407934.54,Rangpur,191050.39,1.303634,-0.524290
3,144372.41,118671.85,383199.62,Dhaka,182901.99,1.156567,-0.097977
4,142107.34,91391.77,366168.42,Rangpur,166187.94,1.119836,-0.761543

# Max Value

In [34]:
mv1 = df5['Marketing Spend'].max()
mv2 = df5['Administration'].max()

In [35]:
mv1
mv2

182645.56

In [36]:
mv1

165349.2

In [37]:
mv2

182645.56

In [38]:
mv1, mv2

(165349.2, 182645.56)

In [39]:
df5['Marketing Spend Transform'] = df5['Marketing Spend'] / mv1
df5['Administration Transform'] = df5['Administration'] / mv2

In [40]:
df5.head()

,Marketing Spend,Administration,Transport,Area,Profit,Marketing Spend Transform,Administration Transform
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.692617,0.749527
1,162597.70,151377.59,443898.53,Ctg,191792.06,0.983359,0.828805
2,153441.51,101145.55,407934.54,Rangpur,191050.39,0.927985,0.553781
3,144372.41,118671.85,383199.62,Dhaka,182901.99,0.873136,0.649738
4,142107.34,91391.77,366168.42,Rangpur,166187.94,0.859438,0.500378